[
  {
    "title": "Scarlet CTF 2026",
    "date": 1767916800000,
    "description": "Listed time is incorrect, the following are the correct dates and times:\r\nStart time: January 9th 12PM EST\r\nEnd time: January 12th 12AM EST\r\n\r\n(The website also has the correct times)\r\n\r\nDiscord: https://discord.gg/ppjN6g3Vm5\r\n\r\nCTF Hosted by the Rutgers University Security Club\r\n\r\nRegular categories: Web, Pwn, Rev, Forensics, Misc.\r\n\r\nIntended for beginners, but with some challenges catering to advanced players aswell",
    "url": "http://ctf.rusec.club/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "UofTCTF 2026",
    "date": 1768003200000,
    "description": "UofTCTF 2026 is the annual capture-the-flag competition organized by the UofTCTF team. This year’s event will take place online from January 9, 2026, at 7:00 PM EST to January 11, 2026, at 7:00 PM EST. It will be a jeopardy-style CTF with classic categories like web, pwn, crypto, rev, forensics, and misc.\r\n\r\nJoin the event discord server: https://discord.gg/4mQP8Tk3JE\r\n\r\nThank you to our generous sponsors, without whom we could not run this event:\r\n- Dataflow Security\r\n- Zellic\r\n- Offsec\r\n- Binary Ninja\r\n- BugCrowd\r\n- KPMG Canada\r\n- Appsurent\r\n- UofT ITS\r\n- UofT DCS\r\n\r\nInfra sponsored by goo.gle/ctfsponsorship",
    "url": "https://ctf.uoftctf.org/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "SCPCTF",
    "date": 1768015800000,
    "description": "Deep down the facility at Site-81, a massive explosion shattered the reinforced containment wing, sending shockwaves through the ice-coated sublevels. Emergency red-and-green holiday lockdown lights flickered wildly, casting festive but unsettling colors across the frost-cracked walls. It had been the annual “Secure Contain Protect Winter Protocol Week,” a rare moment when staff decorated terminals with holographic snowflakes and synthetic pine scent diffusers—until everything went catastrophically wrong.Moments before the blast, researchers were studying SCP-XMAS-239, a crystalline anomaly resembling a floating ornament that emitted harmonic frequencies capable of rewriting electronic systems. When containment failed, the anomaly fractured into thousands of shimmering fragments, each scattering across the database, corrupting files, unlocking challenge nodes, and activating dormant SCP simulations. \r\n\r\nSponsored by: Caido, ApiSec University, Sturtle Security, Unstop and Internshala",
    "url": "https://scpctf.vercel.app/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "New Year CTF 2026",
    "date": 1768035600000,
    "description": "The New Year's CTF 2026, organized by the Beavers0 team from Grodno State University in Belarus, is a competition that has already become a tradition for many.\r\n\r\nThis year, for the first time, the competition will consist of two stages: the Jeopardy CTF (qualifying stage) and an offline incident response competition (final stage).\r\n\r\nThe qualifying stage will include: Cryptography, Web, Reverse, OSINT, Forensics, Steganography and PWN.\r\n\r\nTeams of 1 to 3 people are eligible to participate.\r\n\r\nPlease register at our website\r\nhttp://ctf-spcs.mf.grsu.by\r\n(Registration deadline: 11 Jan 2026)",
    "url": "http://ctf-spcs.mf.grsu.by/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "2026 Embedded Capture the Flag",
    "date": 1768392000000,
    "description": "The Embedded Capture the Flag (eCTF) is an embedded security competition run by MITRE that puts participants through the experience of trying to create a secure system and then learning from their mistakes. The main target is a real physical embedded device, which opens the scope of the challenge to include physical/proximal access attacks. The eCTF is a two-phase competition with attack and defense components. In the first phase, competitors design and implement a secure system based on a set of challenge requirements. The second phase involves analyzing and attacking the other teams’ designs.\r\n\r\nIn the 2026 eCTF, teams will design and implement a secure storage solution for a chip foundry. The system must allow users with various roles to access the proper data without leaking sensitive chip designs to unauthorized parties.\r\n\r\nThe eCTF is only open to active students.",
    "url": "https://ectf.mitre.org/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "CyberCup Indian Ocean",
    "date": 1768579200000,
    "description": "CyberCup Indian Ocean – Stage 1 is the first stage of the CyberCup Indian Ocean cybersecurity competition.\r\n\r\nStage 1 started on January 16 at 20:00 (GMT+4) and will end on Sunday at 20:00 (GMT+4).\r\nParticipation is open to anyone wishing to take part, and individual competitors may join even after the competition has started.\r\n\r\nThe competition is organized around successive challenge waves.\r\nThe second wave is scheduled for Saturday, January 17 at 20:00 (GMT+4).\r\n\r\nCyberCup Indian Ocean is organized by Observatoire de la Cybersécurité de l’Océan Indien (OCOI) and supported by Athern, which provides the dedicated infrastructure and the CTFLAB platform used for the event.\r\n\r\nThe objective of the CyberCup is to strengthen cybersecurity skills across the Indian Ocean region through hands-on, practical challenges.",
    "url": "https://cybercup.ocoi.org/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "SWIMMER OSINT CTF",
    "date": 1768619400000,
    "description": "Story Driven CTF for Beginners (online JP Domestic)\r\nSWIMMER OSINT CTF\r\nby DIVER OSINT CTF\r\n\r\nJan. 17th 2026 (Sat)\r\nAM 3:10 START (UTC)\r\nCompetition Time: 12 hours (END at PM 3:10 UTC)\r\nTeam Members: 1 - 6 people\r\nLanguage: Japanese / English\r\n\r\nNOTE\r\nUnlike the DIVER OSINT CTF, the SWIMMER OSINT CTF is primarily a domestic event. \r\nMost challenge materials will be in Japanese, so you may encounter some language barriers.\r\nThat being said, participants from anywhere in the world are welcome, and we will provide support in both English and Japanese.\r\n\r\nFor more information, follow the official DIVER OSINT CTF account on X\r\nX: @DIVER_OSINT_CTF",
    "url": "https://swimmer.diverctf.org/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "KnightCTF 2026",
    "date": 1768921200000,
    "description": "KnightCTF 2026 is a jeopardy CTF competition for Cyber ​​Security professionals and students or those who are interested in security. There will be challenges in various categories like PWN, Reversing, Web, Cryptography etc.\r\n\r\n\r\nWe like to thanks our sponsors \r\n[+] NSTechValley\r\n[+] AlteredSecurity\r\n[+] APISEC University\r\n[+] Bugcrowd\r\n[+] Hackviser\r\n[+] Knight Squad Academy",
    "url": "https://2026.knightctf.com/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "MetaCTF January 2026 Flash CTF",
    "date": 1769119200000,
    "description": "A monthly CTF hosted by MetaCTF and supported by Antisyphon Training, TCM Security, and Simply Cyber Academy. There will be 5+ challenges, and you will have 3 hours to solve as many as you can.",
    "url": "https://mctf.io/jan2026",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "0xL4ugh CTF v5",
    "date": 1769173200000,
    "description": "0xL4ugh CTF V5 \r\nwe tried to make it hard, useful and funny as much we could, most of challenges this year are based on real life cases and researches.\r\nStay Tunned!\r\n\r\ncategories :\r\n- Web\r\n- DFIR\r\n- Reverse\r\n- Crypto\r\n- Pwn\r\n- Misc\r\n- Osint\r\n- Mobile\r\n- Hardware\r\n\r\nRegistration link : https://ctf.0xL4ugh.com\r\n\r\njoin our Discord For more info : \r\n\r\nhttps://discord.gg/swuAwXE9",
    "url": "https://ctf.0xL4ugh.com/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Säkerhets-SM Quals 2026",
    "date": 1769194800000,
    "description": "Qualifying CTF for the Säkerhets-SM Finals 2026!\r\n\r\nThere will be challenges in the classical CTF categories, and some introduction challenges as well. \r\n\r\nHigh school students from the following countries can qualify for the finals: Sweden, Denmark, Finland, Norway, Estonia, Latvia, Lithuania and Ukraine.\r\n\r\n",
    "url": "https://ctf.sakerhetssm.se/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "HackDay 2026 - Qualifications",
    "date": 1769194800000,
    "description": "BEWARE : The CTF starts at 19:00 UTC+1 - Paris time !\r\nDon't forget to join the Discord : discord.gg/nNZv3QafTW \r\n\r\nThe HackDay challenge is a French cybersecurity competition for graduate students.\r\n\r\nStart of Registration : 2026-01-05 12:00:00 P.M. (Paris)\r\nEnd of Registration : 2026-01-23 12:00:00 P.M. (Paris)\r\n\r\nThe 25 teams selected during the online qualification phase will be invited to compete during the grand final, which will take place on-site within the ESIEE Paris engineering school.\r\n\r\nThe categories are: Crypto, Forensic, Hardware, WEB, Stegano, Reverse and more !\r\nThe three winning teams will be rewarded with many prizes (500€ + sponsor goodies)",
    "url": "https://register.hackday.fr/register/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Dreamhack Invitational Quals 2026",
    "date": 1769212800000,
    "description": "Top 20 competitors of this event will be invited to Dreamhack Invitational 2026 on April 7th, and also receive a ticket for .HACK 2026 Conference.\r\n\r\nPlease check out the Dreamhack discord server (https://discord.com/invite/dreamhackio) for more information about Dreamhack Invitational, and https://dothack.io/ about .HACK 2026.\r\n\r\nQ: Are airplane tickets/hotel rooms supported?\r\nA: No, but we have a plan to support them in next events if possible.",
    "url": "https://dreamhack.io/ctf/772",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "LilacCTF 2026",
    "date": 1769216400000,
    "description": "LilacCTF 2026 is a Jeopardy-style Online Capture The Flag Competition presented by Team Lilac. The contest is open to all participants around the world. Teams can compete from any location. No restriction on the number of participants of any team.\r\nThe Champion Team of LilacCTF 2026 will be invited to The Finals of the 10th Edition of XCTF(the location/date is subject to change, qualified teams will be informed when the Finals location/date is confirmed). Other teams can also get the cumulative points to compete for other slots in The Finals of the 10th Edition of XCTF.",
    "url": "https://lilacctf2026.xctf.org.cn/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "VSL CTF 2026",
    "date": 1769241600000,
    "description": "Start time: January 24th 1 a.m UTC\r\nEnd time: January 25th 1 a.m UTC\r\n\r\nCTF Hosted by the VSL - VKU Security Lab\r\n\r\nCategories: Web, RE, PWN, For, Crypto, Misc, ...\r\n\r\nMainly for beginners.\r\n\r\nPlease fill out the form so we can confirm your registration: \r\n- For Vietnamese: https://forms.gle/1H5QPAP1tZ3tu2ny6\r\n- Global: https://forms.gle/xYfCJJuGWgGErjNX9\r\n\r\nDiscord: https://discord.gg/PSvX9EwtDR\r\n\r\n\r\nSponsor: Offensive Team - FPT Smart Cloud",
    "url": "https://vsl-ctf.com/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Fluid Attacks' CTF 2026-1",
    "date": 1769259600000,
    "description": "24-hour individual online CTF for the Latin American and Caribbean cybersecurity community. Put your technical skills, creativity, persistence, and speed to the test.\r\n\r\nFormat: Individual | Duration: 24 hours | Mode: Online | Prize: $1,000 USD\r\nEligibility: Citizens or permanent residents of Latin America, Brazil, and the Caribbean.",
    "url": "https://fluidattacks.com/ctf",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "CyberQuest 26",
    "date": 1769571000000,
    "description": "Limited Slots Only, Hurry Up Soon!\r\n\r\nCyberQuest is the Capture The Flag (CTF) event conducted by the Department of Computer Science and Engineering (Cyber Security) as part of Kanam 26. \r\n\r\nCyberQuest will be held in three rounds, and each team can have a maximum of four members. This is an on-site event conducted on campus. Every registered participant of CyberQuest is also eligible to attend the DJ Concert, which is one of the attractions of Kanam 26.",
    "url": "https://ngpkanam.com/events/41",
    "type": "CTF",
    "location": "Yerinde"
  },
  {
    "title": "Hack for a Change 2026 January: UN SDG 15",
    "date": 1769731200000,
    "description": "Welcome to the UN SDG CTF. This month’s theme is UN Sustainable Development Goal 15: Life on Land.\r\n\r\nThe challenges are inspired by real issues like biodiversity, deforestation, and ecosystem protection, reimagined as hands-on cybersecurity problems. Expect a mix of web, crypto, forensics, and logic-based challenges that reward curiosity and creative thinking.\r\n\r\nThis CTF is designed to be accessible while still offering depth for experienced players. If you want a competition that feels meaningful, educational, and fun to solve, you’re in the right place. Join in and test your skills while exploring how security connects to the world beyond the screen.",
    "url": "http://www.hackforachange.org/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Jeanne d'Hack CTF 2026 | 3ème Édition",
    "date": 1769763600000,
    "description": "Jeanne d'Hack CTF est une compétition de Capture The Flag qui mettra au défi vos compétences en sécurité informatique. Avec des épreuves variées, du Web à la cryptographie, c'est une occasion parfaite pour tester vos connaissances et collaborer avec d'autres passionnés. Rejoignez-nous pour une journée de défis stimulants et d'apprentissage !",
    "url": "https://www.jeanne-hack-ctf.org/",
    "type": "CTF",
    "location": "Yerinde"
  },
  {
    "title": "ATC Winter Vibes Community CTF 2.0",
    "date": 1769781600000,
    "description": "Get ready to dive into the excitement! The ATC Community is back with our second Winter Vibes Capture The Flag (CTF) event, where teamwork and strategy collide for an unforgettable challenge! Are you in?\r\n\r\n Join us for an exciting virtual CTF where you can test your skills, work with teammates, and enjoy solving cybersecurity puzzles!\r\n\r\n\r\n Dates: January 30, 2026, 2:00 PM EST - January 31, 2026, 2:00 PM EST\r\n\r\n\r\n Format: Online - Participate from anywhere!\r\n\r\n\r\n Prizes: Great rewards for the top three teams!\r\n\r\n\r\n Team Size: Up to 4 players - gather friends or connect with other participants!\r\n\r\n\r\n Skill Levels: All levels welcome, from newcomers to experts!\r\n\r\nDon’t miss this chance to connect with the ATC community and challenge yourself in a friendly setting.\r\n\r\nLet’s make this winter memorable with learning and teamwork! \r\n \r\nBig thanks to our Sponsor, Taylor’D Solutions, LLC, for the prizes and to our fantastic ATC CTF engineering team! This wouldn’t be possible without you!",
    "url": "https://atcwintervibesctf.com/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Eschaton CTF 2026 Quals",
    "date": 1769833800000,
    "description": "PRIZES WORTH ₹30 LAKH+\r\n\r\nESCHATON CTF 2026\r\nAn international Capture The Flag (CTF) competition organized by\r\nMCSC – MITS Cyber Security Club, bringing together student teams from across the world.\r\n\r\nEvent Format\r\n\r\nRound 1: Online Jeopardy-style CTF — 31 January 2026\r\n(Open qualifier for all registered teams)\r\nTiming: 31st Jan 10am IST - 1st Feb 10am IST\r\n\r\nRound 2: Offline Attack–Defense Finals — 21 February 2026\r\n(Top 10 teams from Round 1 qualify, held at MITS Kochi, India)\r\n\r\nHighlights\r\nInternship opportunities for top-performing participants\r\nOpen to students worldwide\r\nFree registration\r\n\r\nSponsors and Partners:\r\nBugcrowd\r\nAPIsec University\r\nLetsDefend\r\nHackTheBox Mumbai\r\nCAIDO\r\nAltered Security\r\nSecLance\r\nK7 Security\r\n\r\nRegistration:\r\nhttps://eschaton.mcsc.space",
    "url": "https://eschaton.mcsc.space/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "PascalCTF 2026",
    "date": 1769846400000,
    "description": "PascalCTF is a cybersecurity event organized by high school students to attract other students to the world of CTFs.\r\nThere'll be 5 challenges for each of these categories:\r\n* Miscellaneous\r\n* Cryptography\r\n* Web Security\r\n* Reverse Engineering\r\n* Artificial Intelligence\r\n* Binary Exploitation\r\n\r\nJoin this event's discord server here: https://discord.gg/GEYETNr3Hp",
    "url": "https://ctf.pascalctf.it/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "BITSCTF 2026",
    "date": 1770355800000,
    "description": "BITSCTF 2026 is a jeopardy-style CTF competition organized by BITSkrieg from BITS Pilani, Goa Campus, India. This flagship event of our annual tech festival, Quark, caters to all skill levels.\r\n\r\nDetails:\r\n- Date: February 6-8, 2026\r\n- Time: 00:00 IST (Feb 7) to 23:59 IST (Feb 8)\r\n- Duration: 48 hours\r\n\r\nCategories include Web Exploitation, Reverse Engineering, Cryptography, Forensics, PWN, and OSINT.\r\n\r\nKey Rules:\r\n1. No Maximum team size\r\n2. Dynamic scoring system\r\n3. Official communication via Discord \r\n4. Valid contact information required for prizes \r\n5. Inappropriate behavior leads to disqualification\r\n6. Administrators' decisions are final\r\n\r\nFull rules, registration, and Discord link will be available on the official BITSCTF website.\r\n\r\n\r\n\r\n\r\nJoin us to showcase your skills and compete with cybersecurity enthusiasts worldwide!",
    "url": "https://ctf.bitskrieg.in/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Pragyan CTF 2026",
    "date": 1770382800000,
    "description": "Pragyan CTF is a capture the flag event developed completely by the students of NIT Trichy that is open to the entire world.\r\n\r\nEvent Start: 6th February 2026, 18:30 IST (6th February 13:00 UTC)\r\nEvent End: 8th February 2026, 18:30 IST (8th February 13:00 UTC)\r\n\r\nDiscord link: https://ctf.prgy.in/discord\r\n\r\nRules of the CTF:\r\n1) Teams: Max 4 members or individual participation.\r\n2) No unauthorized attacks:\r\n - Hacking the host system in unintended ways = Disqualification.\r\n - DoS/DDoS attacks are strictly forbidden.\r\n3) No cheating:\r\n - No sharing answers or collaborating with other teams.\r\n - Brute-forcing flags is not allowed.\r\n4) Confidentiality:\r\nKeep solutions and source codes private during the contest.\r\n5) Communication:\r\n - Only ask doubts directly to organizers.\r\n - No discussions on public forums including discord server.\r\n6) Disqualification: Any rule violation results in immediate disqualification.\r\n7) Judging: Organizers’ decision is final.",
    "url": "https://ctf.prgy.in/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "LA CTF 2026",
    "date": 1770429600000,
    "description": "LA CTF is an annual Capture the Flag (CTF) cybersecurity competition hosted by ACM Cyber at UCLA & Psi Beta Rho. LA CTF is open to all skill levels of cybersecurity! Whether you are tackling your first exploit or have professional experience, there will be challenges just right for you! There will be a variety of events ranging from the competition containing jeopardy-style cybersecurity challenges to talks from UCLA professors to fun events such as meme competitions! If you are interested in attending, join the Discord to stay up to date with the latest information about LA CTF!\r\n\r\nDiscord: https://lac.tf/discord\r\n\r\nChallenge archive can be found here: https://github.com/uclaacm/lactf-archive",
    "url": "https://lac.tf/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Nullcon Goa HackIM 2026 CTF",
    "date": 1770453000000,
    "description": "Join us for yet another installation of the HackIM Nullcon CTF organized by ENOFLAG and win tickets to the Nullcon Goa conference.",
    "url": "https://ctf.nullcon.net/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "DUCKERZ CTF 2026",
    "date": 1770454800000,
    "description": "DUCKERZ CTF is a jeopardy CTF competition for everyone interested in cybersecurity. The competition is developed to help beginners explore new areas in cybersecurity and give experts the opportunity to improve their skills. \r\n\r\nForm a team (max 5 players) and tackle challenges in Crypto, Stegano, Forensic, Web, PWN, Reverse, OSINT, Misc and Hardware.\r\n\r\nOfficial Telegram channel – https://t.me/duckerz\r\nOfficial Telegram chat – https://t.me/duckerz_chat",
    "url": "https://teams.duckerz.ru/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "EncipherX CTF 4.0",
    "date": 1770462000000,
    "description": "EncipherX is a 24-hour national-level Capture The Flag (CTF) competition focused on real-world cybersecurity challenges. Participants compete individually or in teams to solve hands-on, practical problems inspired by real attack and defense scenarios.\r\n\r\nChallenge Categories:\r\nWeb • Crypto • Reversing • Forensics • OSINT • Pwn • Misc • Blockchain\r\n\r\nWho can play: Students & cybersecurity enthusiasts\r\nFormat: Online / Offline (as applicable)\r\nDifficulty: Beginner to Advanced\r\n\r\nEncipherX emphasizes practical learning, project-based problem solving, and real-world security skills under time pressure.          With a ₹10,00,000+ prize pool including cash rewards, international certifications (CRTP, CEH, ASCP, CASA) and industry tool licenses, EncipherX is not just a competition — it is a talent-scouting battlefield for the next generation of red teamers, SOC analysts, and security engineers.",
    "url": "https://encipherx.in/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "0xFUN CTF 2026",
    "date": 1770919200000,
    "description": "0xFUN CTF is an online, 48-hour jeopardy-style Capture The Flag competition for beginners and intermediate players, focused on practical learning in a fun and approachable environment.\r\n\r\n## Categories\r\n- Web\r\n- Pwn\r\n- Reverse Engineering\r\n- Cryptography\r\n- Forensics\r\n- OSINT\r\n- Misc\r\n- …more : )",
    "url": "https://ctf.0xfun.org/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Crackmes.one Reverse Engineering CTF 2026",
    "date": 1771027200000,
    "description": "A week-long CTF dedicated exclusively to reverse engineering.\r\nHosted by crackmes.one, inspired by the legendary Flare-On Challenge.",
    "url": "https://crackmesone.ctfd.io/",
    "type": "CTF",
    "location": "Online"
  },
  {
    "title": "Ransomware Resilience 2026",
    "date": 1768770000000,
    "description": "In the face of the rapidly evolving and perilous landscape of cybersecurity, Ransomware Resilience 2026 offers a critical opportunity to stay informed, upskill, and outwit the relentless cybercriminals who relentlessly threaten our digital world. Cybersecurity is facing a tectonic shift, driven by the unrelenting evolution of ransomware. With the staggering cost of ransomware predicted to reach $265 billion by 2031, according to Cybersecurity Ventures, organizations must rise to the challenge and adapt to stay ahead of the ever-changing landscape of cybercrime Mark your calendars: Ransomware Resilience 2026 Conference returns to Kuala Lumpur for its highly anticipated second edition, where the region’s finest cybersecurity minds will gather to share cutting-edge insights, brainstorm solutions, and forge alliances in the never-ending battle against cyber threats. Physical • Paid • Part of Thomvell International",
    "url": "www.cybersecurityasia.tech",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "Practical Fraud Awareness Training",
    "date": 1768770000000,
    "description": "Practical Fraud Awareness Training is a monthly training program organized by The Netherlands Education Group in partnership with VerifierHub. The January 2026 edition of the training will run from: 📅 19th – 24th January 2026 🕒 3:00 PM – 4:00 PM CET Participants will learn practical fraud investigation and cyber-safety skills including: Identity verification Geolocation of a suspect Deepfake video & audio detection Malicious link & attachment analysis Detection of hacked corporate emails Real fraud case analysis 💶 Fee: €20 per module IMPORTANT: 👉 This is a monthly event. Participants should scan the QR code on the flier or visit: 🔗 https://tneg.nl/practical-fraud-awareness-training to see the monthly schedule and register. Contact: ✉ info@tneg.nl ✉ info@verifierhub.com 📞 +31 85 401 89 52 Online • Paid • Part of The Netherlands Education Group (TNEG)",
    "url": "https://tneg.nl/practical-fraud-awareness-training",
    "type": "CONFERENCE",
    "location": "Online"
  },
  {
    "title": "Ransomware Resilience 2026",
    "date": 1768770000000,
    "description": "Ransomware is one of the most dangerous cybersecurity threats facing organizations globally. The growing frequency and impact of these attacks serve as a stark reminder of the evolving threat landscape and the critical need for organizations to prioritize robust cybersecurity measures to protect their data and mitigate risks. Ransomware Resilience 2026 Conference returns to Kuala Lumpur for its highly anticipated 2nd edition, where the region’s finest cybersecurity minds will gather to share cutting-edge insights, brainstorm solutions, and forge alliances. Physical • Paid • Part of Thomvell International",
    "url": "https://cybersecurityasia.tech/",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "Minutes to Meltdown",
    "date": 1768856400000,
    "description": "Step inside a live ransomware crisis and see how quickly a routine workday can collapse when systems, access controls, and operations fail at once. This interactive session places participants in the middle of a realistic attack scenario inspired by real world breaches, where rapid decisions and leadership coordination determine whether the organization recovers or spirals further into disruption. Working in a small group, attendees take on leadership roles and navigate the critical hours of a ransomware negotiation with guidance from security experts at Commvault and Softcat. The experience focuses on early detection, response strategy, and disaster recovery under pressure. Participants leave with practical takeaways, clearer insight into their own preparedness, and concrete recommendations to strengthen resilience before a real incident occurs. Company_Webinar • Part of CommVault",
    "url": "https://discover.commvault.com/event-minutes-to-metldown-london-softcat-registration.html",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "How to reduce risk across hypervisors and virtual machines",
    "date": 1768856400000,
    "description": "Reducing risk in virtualized environments requires a clear approach to securing both hypervisors and virtual machines. This webinar presents a step by step guide to applying Zero Trust principles in virtual infrastructure, focusing on why hypervisors and VMs are attractive targets and where common security gaps exist. The session explains how to harden the hypervisor, shrink the attack surface and apply deny by default controls to protect virtual machines. The discussion also covers practical ways to prevent breakout attacks, lateral movement and privilege abuse without slowing down IT or security teams. Attendees will gain clarity on what a truly hardened virtual environment looks like and which actions to prioritize first. The webinar concludes with practical takeaways that can be applied immediately, without requiring a full redesign of existing systems. Company_Webinar • Part of ThreatLocker",
    "url": "https://www.threatlocker.com/webinars/how-to-reduce-risk-across-hypervisors-and-virtual-machines",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Threat-INFORM Your Defenses",
    "date": 1768856400000,
    "description": "Get a clear introduction to threat informed defense and see how organizations are using it to measure and improve security against real world threats. This webinar provides an inside look at the latest updates to the INFORM maturity model, released by MITRE, and explains how the framework helps teams baseline their security posture, prioritize investments and track progress over time. The session covers the core fundamentals of INFORM, what has changed in the updated model and how it is being applied in active security programs. Attendees will also hear practical insights during a live Q and A discussion, making this webinar useful for teams looking to start or advance a threat informed defense assessment. Company_Webinar • Part of AttackIQ",
    "url": "https://www.attackiq.com/resources/webinars/threat-inform-your-defenses/",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Secure and Accelerate AI Workloads: Maximize Innovation While Keeping Your Data Safe with AppGate ZTNA",
    "date": 1768856400000,
    "description": "Securing autonomous AI workloads is becoming a core requirement as organizations expand the use of AI agents, APIs and dynamic cloud environments. This webinar focuses on how AppGate applies Zero Trust Network Access to protect AI workloads using identity driven, headless security that supports performance and innovation rather than slowing it down. The discussion explains how ZTNA can be applied across AI agents, servers, virtual machines and Kubernetes workloads to reduce lateral movement and protect exposed APIs. Attendees will also hear how organizations are deploying autonomous AI systems while maintaining compliance and operational efficiency. This table talk session is designed for teams looking to secure modern AI environments without relying on legacy perimeter based security models. Company_Webinar • Part of Appgate",
    "url": "https://ww3.appgate.com/ztnatabletalks-demo",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "IT Contracts 2026",
    "date": 1768856400000,
    "description": "IT Contracts 2026 centers on how shifting global conditions are reshaping the way organizations structure and manage IT agreements. The event brings together legal experts, consultants, and IT leaders to examine real risks, regulatory expectations, and practical contract applications. Sessions cover both private and public sector perspectives, offering clear examples of how to align complex agreements with real-world business needs. This year’s focus on the D17 standard contract update makes it especially timely for professionals handling compliance-heavy projects. Attendees gain direct insight into regulatory changes, AI’s role in contract work, and how global politics affect supplier relationships. The conference also emphasizes using contracts as strategic tools rather than obstacles. With a mix of expert talks, discussions, and peer exchange, IT Contracts 2026 gives participants a grounded view of where IT law and governance are headed in the coming years. Physical • Paid • Part of Insight Events Denmark",
    "url": "https://insightevents.dk/event/it-kontrakter/",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "Cyber Forum: AI & Automation",
    "date": 1768856400000,
    "description": "This virtual cybersecurity forum focuses on how AI and automation are reshaping security operations and changing the way teams defend against modern threats. The discussion centers on current adversary trends, practical AI driven innovation and how automation can reduce operational strain while improving response speed and accuracy. Built for security leaders, the event highlights how advanced tooling can strengthen defenses, streamline daily workflows and create measurable business value. Attendees will gain a clearer view of where security operations are headed and how AI and automation fit into the future of effective cyber defense. Company_Webinar • Part of SentinelOne",
    "url": "https://www.sentinelone.com/lp/cyber-forum-ai-automation/?mkt_tok=MzI3LU1OTS0wODcAAAGe6RgxxStCsUgpk6985wgoeIOHra1cb8n4Tj8yw5wG3hVHSI2GadaBK1OVLxFBt4mNRxWUgrWP9smWgk6b6C-Y1Eun5WiVMiZXeLO140GMd7W_pZ71HQ",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "From AI SOC to AI in the SOC (and beyond)",
    "date": 1768856400000,
    "description": "The next chapter of SecOps is not just AI SOC, it’s something much bigger. While others have talked endlessly about AI, we’ve stayed quiet. As major security vendors raced to announce chatbots and copilots, we were watching, building, and innovating. Now we have something to say. Join us on January 20th for a live session demonstrating a fundamentally different approach to AI-powered security operations. See lightning-fast autonomous investigations, queries, and responses happening in real time. Once you witness how LimaCharlie is changing the relationship between AI and human operators, your security operations will never be the same. Online • Part of LimaCharlie",
    "url": "https://limacharlie.io/agentic-secops-workspace?utm_source=infosec-conferences",
    "type": "CONFERENCE",
    "location": "Online"
  },
  {
    "title": "ERTL-YANG Leader Summit 2026: Helsinki",
    "date": 1768856400000,
    "description": "The ERTL-YANG Leader Summit 2026 in Helsinki is designed for executives and security leaders who oversee cybersecurity strategy at an organizational level. The summit addresses how leadership decisions influence cyber risk, operational resilience, and long term digital security in a rapidly changing threat landscape. Participants engage in focused discussions around cybersecurity governance, data protection, and emerging risks tied to cloud adoption, AI, and interconnected supply chains. The summit emphasizes practical leadership perspectives, helping attendees understand how to integrate cybersecurity into broader business strategy while fostering collaboration between technology, risk, and executive teams. Physical • Paid • Part of ERTL-YANG",
    "url": "https://www.ertl-yang.com/summits-2026/ertl-yang-leader-summit-helsinki/overview",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "Meet Huntress: Live Demo & AMA with Sasha Roshan",
    "date": 1768856400000,
    "description": "See Huntress in action during a live demo and open AMA led by Sasha Roshan, focused on real world security challenges faced by today’s organizations. The session showcases how Huntress helps teams detect and respond to active threats while continuously improving protection across environments. Participants are invited to bring practical questions, everyday security problems and real scenarios for discussion. The webinar is designed to give clear insight into how Huntress approaches threat detection and response, with direct answers and guidance that security teams can apply immediately. Company_Webinar • Part of Huntress",
    "url": "https://www.huntress.com/upcoming-webinars/meet-huntress-live-demo-and-ama-with-sasha-roshan-01202026",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "AKJ Associates: Securing Financial Services January 2026",
    "date": 1768856400000,
    "description": "This conference gathers cybersecurity and risk professionals from across banking, insurance, and fintech to address emerging cyber threats in the financial ecosystem. Speakers will share insights into fraud prevention, digital identity, and data protection, focusing on maintaining customer trust while meeting strict regulatory standards. Through case-based discussions and peer sessions, participants will hear how leading institutions balance innovation and compliance. Topics such as real-time threat intelligence, cloud resilience, and incident response planning take center stage. The goal is to give financial institutions the clarity and tools needed to protect sensitive assets and maintain operational integrity. Physical • Paid • Part of AKJ Associates",
    "url": "https://akjassociates.com/event/finserv",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "Rethinking Mobile: From Zero Touch to Zero Trust",
    "date": 1768856400000,
    "description": "Modern enterprises are rethinking how mobile devices are secured and managed as they become the most widely used endpoint in the organization. This webinar focuses on the shift from traditional mobile management toward zero touch workflows and Zero Trust security, addressing the challenges created by mixed ownership models, limited visibility and evolving threats. The session explains why mobile requires a dedicated security approach and how modern workflows can reduce complexity while improving protection. The discussion covers practical ways to support BYOD, shared and one to one device models while maintaining continuous security and compliance. Attendees will see real workflow examples, including zero touch setup, return to service scenarios and security event handling, along with insights into balancing user experience and Zero Trust requirements. The webinar is designed for teams looking to modernize their mobile strategy at scale. Company_Webinar • Part of Jamf",
    "url": "https://www.jamf.com/webinars/rethinking-mobile-from-zero-touch-to-zero-trust/apac/0/",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Tapping Into Trouble: The Hidden Dangers of Mobile App Proliferation",
    "date": 1768856400000,
    "description": "Mobile apps have become a high value target for attackers, and this session breaks down how real threats emerge when security is treated as optional or left to operating systems and app stores. The webinar examines how adversaries analyze and reverse engineer mobile applications, exploit weaknesses in client side logic and SDKs and use compromised devices to bypass identity checks, monetization flows and access sensitive data. The discussion highlights why mobile apps now function as critical infrastructure and why older web centric security models leave gaps. Attendees will see practical defensive measures, including obfuscation, RASP, device attestation and threat monitoring, along with ways to use device intelligence to strengthen backend decisions and prevent fraud. The session is designed for teams that need a clearer view of modern mobile risks and how to defend against them. Company_Webinar • Part of Guardsquare",
    "url": "https://www.guardsquare.com/webinar-tapping-into-trouble-the-hidden-dangers-of-mobile-app-proliferation/",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Agentic AI Breaks Traditional Data Security",
    "date": 1768856400000,
    "description": "Agentic AI is changing how sensitive data moves across systems, creating new security and compliance risks when information flows through prompts, logs, and automated tools. This webinar focuses on why traditional data security controls fall short in agent driven environments and what teams can do to regain control as AI agents operate in real time. The session covers practical approaches for protecting sensitive data at runtime, enforcing least privilege access for AI agents, and deploying agentic AI in production without unexpected compliance issues. Speakers from Skyflow will share how security teams can reduce exposure, maintain visibility, and confidently support AI adoption without slowing innovation. Company_Webinar • Part of Skyflow",
    "url": "https://www.skyflow.com/webinars/future-agentic-ai-security",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Guardrails for AI: Secure, Monitor, Optimize with AI Gateway",
    "date": 1768856400000,
    "description": "This workshop focuses on securing, monitoring, and optimizing AI applications deployed at the edge using Cloudflare’s AI Gateway and Workers AI. The session shows how teams can move beyond traditional deployment models and build fast, multimodal AI workloads while maintaining control, visibility, and performance. Attendees will see how guardrails help manage AI usage, reduce risk, and improve reliability in serverless environments. The session covers practical implementations such as LLM based chat applications, real time object detection, audio translation, and voice driven assistants. Participants will also gain insight into prompt structure, latency optimization, and deploying multimodal AI experiences at scale. A live demo showcases real world examples including text generation, image classification, audio translation, and computer vision use cases running directly at the edge. Company_Webinar • Part of Cloudflare",
    "url": "https://cloudflare.registration.goldcast.io/events/0a4779d6-a66b-4e77-9c8e-dc1ce490b9f5",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Learn How to Automate Compliance for ISO 27001, GDPR, and More",
    "date": 1768856400000,
    "description": "This webinar focuses on automating security and compliance as organizations grow and manage increasing regulatory demands. The session shows how teams can simplify evidence collection, monitoring, and reporting across multiple frameworks such as ISO 27001, SOC 2, and GDPR using a centralized approach. The discussion highlights how automation reduces manual effort, lowers compliance costs, and strengthens overall security posture without slowing business growth. Attendees will also see a live walkthrough of the Vanta platform and hear practical guidance during an interactive Q and A on staying audit ready while scaling securely. Company_Webinar • Part of Vanta",
    "url": "https://www.vanta.com/webinars/learn-how-to-automate-compliance-for-iso-27001-gdpr-and-more",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "A New Dawn for Cybersecurity: CISO Dinner & Roundtable Discussion 2026",
    "date": 1768856400000,
    "description": "This private dinner and roundtable hosted by Menlo Security (with Redapt and Arctic Wolf) brings together senior cybersecurity leaders for a focused discussion on 2026 priorities and evolving cyber threats. The intimate setting over a chef-crafted dinner offers a unique chance to share experiences, explore advanced defense strategies, and network with peers from across the Pacific Northwest. Given rising risks driven by AI and advanced computing, the conversation will center on how organizations can adapt their security posture to counter modern threats. Participants will leave with actionable insights and new connections aimed at strengthening their organization’s resilience. Physical • Paid • Part of Menlo Security",
    "url": "https://info.menlosecurity.com/Bellevue-CISO-Dinner-and-Panel-Discussion.html",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "Tapping Into Trouble: The Hidden Dangers of Mobile App Proliferation",
    "date": 1768856400000,
    "description": "Mobile app security has become a critical risk area as apps increasingly handle identity, payments and sensitive customer interactions. This webinar focuses on how attackers target mobile applications running on devices outside an organization’s control and why relying on app stores or operating systems creates dangerous blind spots. The discussion explains how weaknesses in client side logic, SDKs and on device data are exploited to commit fraud, bypass controls and access sensitive information. The session breaks down real attacker techniques, including reverse engineering, static and dynamic analysis, repackaging and malware abuse. It also addresses common misconceptions around built in platform security and outlines practical defenses such as obfuscation, runtime protection, device binding and threat monitoring. Attendees will gain insight into how device intelligence can strengthen backend decisions and improve fraud prevention across the mobile ecosystem. Company_Webinar • Part of Guardsquare",
    "url": "https://www.guardsquare.com/webinar-tapping-into-trouble-the-hidden-dangers-of-mobile-app-proliferation",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "AKJ Associates: Securing the Law Firm January 2026",
    "date": 1768856400000,
    "description": "This event focuses on the growing cybersecurity challenges faced by law firms as they handle vast amounts of confidential client data. Experts will explore how evolving threats target legal workflows, from phishing campaigns to insider risks and third-party vulnerabilities. Attendees will learn how to strengthen their digital defenses and reduce exposure through practical measures that align with compliance and client trust expectations. The program highlights real case studies from law firms that have successfully navigated data breaches and regulatory pressures. It’s designed for IT leaders, risk managers, and partners who want to build a resilient security culture within their firm. Every session aims to turn lessons learned into clear, actionable practices that protect legal operations in an increasingly digital world. Physical • Paid • Part of AKJ Associates",
    "url": "https://akjassociates.com/event/stlf",
    "type": "CONFERENCE",
    "location": "Physical"
  },
  {
    "title": "How the Risk Leader Role Has Changed – and What It Takes to Lead Today",
    "date": 1768856400000,
    "description": "Risk leadership is becoming more visible and more closely tied to business performance, forcing senior leaders to rethink how they operate. This session brings together experienced risk and procurement leaders to discuss how their roles have evolved as risk becomes more interconnected across the organization. The conversation focuses on how modern risk leaders collaborate with teams such as cybersecurity, insurance, ESG and operations to manage risk beyond traditional boundaries. The speakers share real world insights on how expectations have shifted as risk reaches the boardroom, what leaders are now accountable for and which skills have proven most valuable over time. Attendees will gain perspective on what it takes to lead effectively in today’s risk environment and how successful leaders are adapting to increased scrutiny and responsibility. Company_Webinar • Part of Supply Wisdom",
    "url": "https://landing.supplywisdom.com/webinar-how-the-risk-leader-role-has-changed",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Cybersecurity in 2026: Trends that will shape the future",
    "date": 1768856400000,
    "description": "Cybersecurity leaders face a rapidly changing threat environment as new technologies and attack methods reshape risk in 2026. This webinar brings together Barracuda security experts to examine the trends and shifts that organizations need to understand as they plan for the year ahead. The discussion focuses on how evolving threats and emerging technologies, including AI, are influencing modern security strategies. The session highlights why building long term cybersecurity resilience is critical and which practices and solution areas can help strengthen defenses as threats continue to evolve. Attendees will gain clear insight into upcoming cybersecurity trends, technology developments and practical considerations that can help teams stay prepared for what lies ahead. Company_Webinar • Part of Barracuda",
    "url": "https://lp.barracuda.com/BEU-AMER-WBN-20260121-SP-MSP-Predictions_LP-Registration.html",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Office Hours: Cove Data Protection",
    "date": 1768856400000,
    "description": "Get direct guidance on protecting and recovering critical data using N-able Cove Data Protection in this interactive office hours session. The discussion is designed for teams that want clearer answers on backup and recovery workflows, product capabilities, and how to improve recovery success across real world environments. The session brings together N-able experts who address common backup and recovery challenges, walk through recent product updates, and share practical automation and scripting examples. Attendees can ask questions, provide feedback, and gain insight into upcoming roadmap plans, all with the goal of strengthening data resilience and reducing recovery risk. Company_Webinar • Part of N-Able",
    "url": "https://www.n-able.com/events/head-nerd-event/office-hours-cove-data-protection-january",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "AI Driven Threats, Old Realities: A Deep Dive into Trend Micro’s 2026 Security Predictions",
    "date": 1768856400000,
    "description": "AI is reshaping the cyber threat landscape in ways that go far beyond marketing claims, and this webinar takes a realistic look at what that shift means in practice. The session examines how AI is being used by both attackers and defenders, with a focus on where it introduces new risks, disrupts security at critical moments and blurs the boundary between classic social engineering and automated attacks. Built on Trend Micro’s 2026 security predictions, the discussion explains how AI often acts as an enabling layer that helps existing threats evolve while accelerating the emergence of new ones. Attendees will gain insight into the underlying dynamics that will influence cyber risk in the years ahead and better understand which factors are likely to matter most as AI continues to shape modern attack methods and defense strategies. Company_Webinar • Part of Trend Micro",
    "url": "https://www.trendmicro.com/explore/webinar-predictions-2026-en",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "The autonomous MSP: Scaling endpoint and Microsoft service delivery with automation and AI",
    "date": 1768856400000,
    "description": "This webinar examines how MSPs can scale endpoint and Microsoft 365 service delivery by combining automation, AI and integrated cybersecurity. Acronis experts and industry leaders outline how platformization is shaping the next stage of MSP growth and why AI driven workflows are becoming essential for improving margins and simplifying day to day operations. The discussion highlights practical ways AI reduces repetitive tasks, strengthens protection and improves overall service delivery from a single platform. Attendees will see how a unified Microsoft 365 solution supports higher efficiency, hear examples of real world performance gains and understand how autonomous cybersecurity is emerging as a key advantage for modern MSPs. The session also explains how MSPs can advance toward MSP 3.0 maturity through automation, native integration and faster resolution times powered by AI. Company_Webinar • Part of Acronis",
    "url": "https://acronis.events/event/the-autonomous-msp/",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Real-World Healthcare Security: A Pragmatic Approach to Protection and Compliance",
    "date": 1768856400000,
    "description": "Protecting healthcare environments requires balancing security, compliance, and uninterrupted patient care. This webinar focuses on a practical approach to defending healthcare systems against modern cyber threats while supporting day to day clinical operations. The discussion centers on real world challenges faced by healthcare organizations, including legacy infrastructure, connected medical devices, and strict regulatory requirements. The session explains how to secure systems that cannot be easily patched, such as older platforms and IoMT devices, without increasing operational risk. It also shows how to cut through vulnerability noise by prioritizing issues that are truly exploitable, rather than chasing long checklists. Attendees will gain insight into moving beyond paper based compliance frameworks like HIPAA and HITRUST and toward active, real time protection that strengthens both security posture and audit readiness. Company_Webinar • Part of Picus Security",
    "url": "https://www.picussecurity.com/resource/webinar/real-world-healthcare-security-a-pragmatic-approach-to-protection-and-compliance",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Cybersecurity Threat Research Series: Intercepted",
    "date": 1768942800000,
    "description": "Security teams face a threat landscape where identity has become the primary attack surface and adversaries are using automation and AI to move faster and at greater scale. This monthly videocast delivers focused intelligence on how attackers are operating, where identity risks are emerging and what defenders can do to stay ahead in complex cloud and enterprise environments. Led by Proofpoint threat researchers, the series provides ongoing insight into active campaigns, emerging techniques and real world attack patterns. Each session combines expert analysis, technical deep dives and practical guidance to help CISOs, analysts and security engineers improve detection, response and resilience. Live Q and A discussions allow attendees to engage directly with researchers and get clear answers to current security challenges. Company_Webinar • Part of Proofpoint",
    "url": "https://www.proofpoint.com/us/resources/webinars/intercepted",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "Darktrace's Business Centric Approach with Self-Learning AI",
    "date": 1768942800000,
    "description": "Darktrace Decode returns with a technical session focused on Darktrace’s business centric approach to cybersecurity using self learning AI. The webinar explains how Darktrace’s core AI philosophy is designed to understand normal business behavior and build context across an organization, allowing security teams to detect threats that do not rely on known signatures. The session walks through the architecture behind self learning AI, showing how it adapts to unique environments and identifies novel threats earlier than traditional security tools. Attendees will also see how this approach is deployed in real environments and have the opportunity to engage directly with Darktrace technical experts during a live Q and A. Company_Webinar • Part of Darktrace",
    "url": "https://www.darktrace.com/partner-webinars/darktrace-decode-partner-technical-series-business-centric-approach-with-self-learning-ai",
    "type": "CONFERENCE",
    "location": "Other"
  },
  {
    "title": "AI Is Here. Your Developers Aren’t Ready—Yet.",
    "date": 1768942800000,
    "description": "Developer readiness is becoming a major security challenge as AI rapidly changes how software is built. This webinar focuses on how organizations can prepare development teams to work securely in AI assisted workflows without slowing innovation. The discussion centers on new secure development approaches designed for an environment where AI tools influence coding, decision making and delivery speed. The session covers practical training paths that address AI governance, safe usage and secure development in real world workflows. Attendees will also see how emerging practices like vibe coding are shaping modern engineering and why benchmarking developer readiness is critical. The webinar highlights proactive tools that guide developers as they work and explains how organizations can strengthen secure coding skills while embracing AI driven development. Company_Webinar • Part of Security Journey",
    "url": "https://info.securityjourney.com/ai-is-here-webinar",
    "type": "CONFERENCE",
    "location": "Other"
  }
]